Revit 2024 API
ElementRecord.GetCategoryId Method
 Gets the category id of the element record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId GetCategoryId()
Visual Basic
Public Function GetCategoryId As ElementId
Visual C++
public:
ElementId^ GetCategoryId()
Return Value
 The category id.
See Also
ElementRecord Class
Autodesk.Revit.DB Namespace